package com.tech.miaa.abdmApi;

public enum SigunguEnum {
    HOME("6110000", "6119999", "가정보호"),
    GANGNAM("6110000", "3220000", "강남구"),
    GANGDONG("6110000", "3240000", "강동구"),
    GANGBOOK("6110000", "3080000", "강북구"),
    GANGSEO("6110000", "3150000", "강서구"),
    GWANAK("6110000", "3200000", "관악구"),
    GWANGJIN("6110000", "3040000", "광진구"),
    GURO("6110000", "3160000", "구로구"),
    GEUMCHEON("6110000", "3170000", "금천구"),
    NOWON("6110000", "3100000", "노원구"),
    DOBONG("6110000", "3090000", "도봉구"),
    DONGDEAMUN("6110000", "3050000", "동대문구"),
    DONGJAK("6110000", "3190000", "동작구"),
    MAPO("6110000", "3130000", "마포구"),
    SEODAEMUN("6110000", "3120000", "서대문구"),
    SEOUL("6110000", "6119998", "서울특별시"),
    SEOCHO("6110000", "3210000", "서초구"),

    QEWTQWER("6110000","3030000", "성동구"),
    QEWRQET("6110000","3070000", "성북구"),
    GDFGH("6110000","3230000", "송파구"),
    QERQEWTHGFD("6110000","3140000", "양천구"),
    DOBOEWQTQWETNG("6110000","3180000", "영등포구"),
    QEWTQWETQ("6110000","3020000", "용산구"),
    QEWRQT("6110000","3110000", "은평구"),
    QRTYQRYQ("6110000","3000000", "종로구"),
    QEWFJKL("6110000","3010000", "중구"),
    DUFQOI("6110000","3060000", "중랑구"),

    ///
    ETRYERTY("6260000","3360000", "강서구"),
    DDGH("6260000","3350000", "금정구"),
    E5676YD("6260000","3400000", "기장군"),
    MVMFHJ("6260000","3310000", "남구"),
    YTIRI("6260000","3270000", "동구"),
    QEWTQRY("6260000","3300000", "동래구"),
    TUERTUE("6260000","3290000", "부산진구"),
    DOBONQEQERG("6260000","3320000", "북구"),
    DOBONGWRTWR("6260000","3390000", "사상구"),
    DOBONGRTYIRTY("6260000","3340000", "사하구"),
    DOBONGRYTURI("6260000","3260000", "서구"),
    DOBONGCZVZ("6260000","3380000", "수영구"),
    DOBONGWTYRWR("6260000","3370000", "연제구"),
    DOBONGWTRY("6260000","3280000", "영도구"),
    DOBONGQETQ("6260000","3250000", "중구"),
    DOBONGDFEW("6260000","3330000", "해운대구");
//    ////
//    DOBONG("6270000","5141000", "군위군"),
//    DOBONG("6270000","3440000", "남구"),
//    DOBONG("6270000","3470000", "달서구"),
//    DOBONG("6270000","3480000", "달성군"),
//    DOBONG("6270000","3420000", "동구"),
//    DOBONG("6270000","3450000", "북구"),
//    DOBONG("6270000","3430000", "서구"),
//    DOBONG("6270000","3460000", "수성구"),
//    DOBONG("6270000","3410000", "중구"),
//    ////
//    DOBONG("6280000","3570000", "강화군"),
//    DOBONG("6280000","3550000", "계양구"),
//    DOBONG("6280000","3530000", "남동구"),
//    DOBONG("6280000","3500000", "동구"),
//    DOBONG("6280000","3510500", "미추홀구"),
//    DOBONG("6280000","3540000", "부평구"),
//    DOBONG("6280000","3560000", "서구"),
//    DOBONG("6280000","3520000", "연수구"),
//    DOBONG("6280000","3580000", "옹진군"),
//    DOBONG("6280000","3490000", "중구"),
//    ///
//    DOBONG("6290000","6299998", "광산구"),
//    DOBONG("6290000","6299998", "광주광역시"),
//    DOBONG("6290000","3610000", "남구"),
//    DOBONG("6290000","3590000", "동구"),
//    DOBONG("6290000","3620000", "북구"),
//    DOBONG("6290000","3600000", "서구"),
//    ///
//    //5690000
//    //없음
//    ///
//    DOBONG("6300000","3680000", "대덕구"),
//    DOBONG("6300000","3640000", "동구"),
//    DOBONG("6300000","3660000", "서구"),
//    DOBONG("6300000","3670000", "유성구"),
//    DOBONG("6300000","3650000", "중구"),
//    ///
//    DOBONG("6310000","3700000", "남구"),
//    DOBONG("6310000","3710000", "동구"),
//    DOBONG("6310000","3720000", "북구"),
//    DOBONG("6310000","3730000", "울주군"),
//    DOBONG("6310000","3690000", "중구"),
//    ///
//    DOBONG("6410000","4160000", "가평군"),
//    DOBONG("6410000","3940000", "고양시"),
//    DOBONG("6410000","3970000", "과천시"),
//    DOBONG("6410000","3900000", "광명시"),
//    DOBONG("6410000","5540000", "광주시"),
//    DOBONG("6410000","3980000", "구리시"),
//    DOBONG("6410000","4020000", "군포시"),
//    DOBONG("6410000","5630000", "기흥구"),
//    DOBONG("6410000","4090000", "김포시"),
//    DOBONG("6410000","3990000", "남양주시"),
//    DOBONG("6410000","3920000", "동두천시"),
//    DOBONG("6410000","3860000", "부천시"),
//    DOBONG("6410000","3780000", "성남시"),
//    DOBONG("6410000","3740000", "수원시"),
//    DOBONG("6410000","4010000", "시흥시"),
//    DOBONG("6410000","3930000", "안산시"),
//    DOBONG("6410000","3830000", "안양시"),
//    DOBONG("6410000","5590000", "양주시"),
//    DOBONG("6410000","4170000", "양평군"),
//    DOBONG("6410000","5700000", "여주시"),
//    DOBONG("6410000","4140000", "연천군"),
//    DOBONG("6410000","4000000", "오산시"),
//    DOBONG("6410000","4050000", "용인시"),
//    DOBONG("6410000","4030000", "의왕시"),
//    DOBONG("6410000","3820000", "의정부시"),
//    DOBONG("6410000","4070000", "이천시"),
//    DOBONG("6410000","4060000", "파주시"),
//    DOBONG("6410000","3910000", "평택시"),
//    DOBONG("6410000","5600000", "포천시"),
//    DOBONG("6410000","4040000", "하남시"),
//    DOBONG("6410000","5530000", "화성시"),
//    ///
//    DOBONG("6530000","4201000", "강릉시"),
//    DOBONG("6530000","4341000", "고성군"),
//    DOBONG("6530000","4211000", "동해시"),
//    DOBONG("6530000","4241000", "삼척시"),
//    DOBONG("6530000","4231000", "속초시"),
//    DOBONG("6530000","4321000", "양구군"),
//    DOBONG("6530000","4351000", "양양군"),
//    DOBONG("6530000","4271000", "영월군"),
//    DOBONG("6530000","4191000", "원주시"),
//    DOBONG("6530000","4331000", "인제군"),
//    DOBONG("6530000","4291000", "정선군"),
//    DOBONG("6530000","4301000", "철원군"),
//    DOBONG("6530000","4181000", "춘천시"),
//    DOBONG("6530000","4221000", "태백시"),
//    DOBONG("6530000","4281000", "평창군"),
//    DOBONG("6530000","4251000", "홍천군"),
//    DOBONG("6530000","4311000", "화천군"),
//    DOBONG("6530000","4261000", "횡성군"),
//    ///
//    DOBONG("6430000","4460000", "괴산군"),
//    DOBONG("6430000","4480000", "단양군"),
//    DOBONG("6430000","4420000", "보은군"),
//    DOBONG("6430000","4440000", "영동군"),
//    DOBONG("6430000","4430000", "옥천군"),
//    DOBONG("6430000","4470000", "음성군"),
//    DOBONG("6430000","4400000", "제천시"),
//    DOBONG("6430000","5570000", "증평군"),
//    DOBONG("6430000","4450000", "진천군"),
//    DOBONG("6430000","5710000", "청주시"),
//    DOBONG("6430000","4390000", "충주시"),
//    ///
//    DOBONG("6440000","5580000", "계룡시"),
//    DOBONG("6440000","4500000", "공주시"),
//    DOBONG("6440000","4550000", "금산군"),
//    DOBONG("6440000","4540000", "논산시"),
//    DOBONG("6440000","5680000", "당진시"),
//    DOBONG("6440000","4510000", "보령시"),
//    DOBONG("6440000","5680000", "당진시"),
//    DOBONG("6440000","4570000", "부여군"),
//    DOBONG("6440000","4530000", "서산시"),
//    DOBONG("6440000","4580000", "서천군"),
//    DOBONG("6440000","4520000", "아산시"),
//    DOBONG("6440000","4560000", "연기군"),
//    DOBONG("6440000","4610000", "예산군"),
//    DOBONG("6440000","4490000", "천안시"),
//    DOBONG("6440000","4590000", "청양군"),
//    DOBONG("6440000","4620000", "태안군"),
//    DOBONG("6440000","4600000", "홍성군"),
//    ///
//
//    DOBONG("6540000","4781000", "고창군"),
//    DOBONG("6540000","4671000", "군산시"),
//    DOBONG("6540000","4711000", "김제시"),
//    DOBONG("6540000","4701000", "남원시"),
//    DOBONG("6540000","4741000", "무주군"),
//    DOBONG("6540000","4791000", "부안군"),
//    DOBONG("6540000","4771000", "순창군"),
//    DOBONG("6540000","4721000", "완주군"),
//    DOBONG("6540000","4681000", "익산시"),
//    DOBONG("6540000","4761000", "임실군"),
//    DOBONG("6540000","4751000", "장수군"),
//    DOBONG("6540000","4641000", "전주시"),
//    DOBONG("6540000","4691000", "정읍시"),
//    DOBONG("6540000","4731000", "진안군"),
//    ///
//    DOBONG("6460000","4920000", "강진군"),
//    DOBONG("6460000","4880000", "고흥군"),
//    DOBONG("6460000","4860000", "곡성군"),
//    DOBONG("6460000","4840000", "광양시"),
//    DOBONG("6460000","4870000", "구례군"),
//    DOBONG("6460000","4830000", "나주시"),
//    DOBONG("6460000","4850000", "담양군"),
//    DOBONG("6460000","4800000", "목포시"),
//    DOBONG("6460000","4950000", "무안군"),
//    DOBONG("6460000","4890000", "보성군"),
//    DOBONG("6460000","4820000", "순천시"),
//    DOBONG("6460000","5010000", "신안군"),
//    DOBONG("6460000","4810000", "여수시"),
//    DOBONG("6460000","4970000", "영광군"),
//    DOBONG("6460000","4940000", "영암군"),
//    DOBONG("6460000","4990000", "완도군"),
//    DOBONG("6460000","4980000", "장성군"),
//    DOBONG("6460000","4910000", "장흥군"),
//    DOBONG("6460000","5000000", "진도군"),
//    DOBONG("6460000","4960000", "함평군"),
//    DOBONG("6460000","4930000", "해남군"),
//    DOBONG("6460000","4900000", "화순군"),
//    //
//    DOBONG("6470000","5130000", "경산시"),
//    DOBONG("6470000","6479998", "경상북도"),
//    DOBONG("6470000","5050000", "경주시"),
//    DOBONG("6470000","5200000", "고령군"),
//    DOBONG("6470000","5080000", "구미시"),
//    DOBONG("6470000","5060000", "김천시"),
//    DOBONG("6470000","5120000", "문경시"),
//    DOBONG("6470000","5240000", "봉화군"),
//    DOBONG("6470000","5110000", "상주시"),
//    DOBONG("6470000","5210000", "성주군"),
//    DOBONG("6470000","5070000", "안동시"),
//    DOBONG("6470000","5180000", "영덕군"),
//    DOBONG("6470000","5170000", "영양군"),
//    DOBONG("6470000","5090000", "영주시"),
//    DOBONG("6470000","5100000", "영천시"),
//    DOBONG("6470000","5230000", "예천군"),
//    DOBONG("6470000","5260000", "울릉군"),
//    DOBONG("6470000","5250000", "울진군"),
//    DOBONG("6470000","5150000", "의성군"),
//    DOBONG("6470000","5190000", "청도군"),
//    DOBONG("6470000","5160000", "청송군"),
//    DOBONG("6470000","5220000", "칠곡군"),
//    DOBONG("6470000","5020000", "포항시"),
//    /
//    DOBONG("6480000","5370000", "거제시"),
//    DOBONG("6470000","5470000", "거창군"),
//    DOBONG("6470000","5420000", "고성군"),
//    DOBONG("6470000","5350000", "김해시"),
//    DOBONG("6470000","5430000", "남해군"),
//    DOBONG("6470000","5360000", "밀양시"),
//    DOBONG("6470000","5340000", "사천시"),
//    DOBONG("6470000","5450000", "산청군"),
//    DOBONG("6470000","5380000", "양산시"),
//    DOBONG("6470000","5390000", "의령군"),
//    DOBONG("6470000","5310000", "진주시"),
//    DOBONG("6470000","5410000", "창녕군"),
//    DOBONG("6470000","5320000", "창원시"),
//    DOBONG("6470000","5280000", "창원시"),
//    DOBONG("6470000","5670000", "창원시"),
//    DOBONG("6470000","5330000", "통영시"),
//    DOBONG("6470000","5440000", "하동군"),
//    DOBONG("6470000","5400000", "함안군"),
//    DOBONG("6470000","5460000", "함양군"),
//    DOBONG("6470000","5480000", "합천군"),
//    DOBONG("6470000","6489999", ""),
//        //
//        DOBONG("6500000","6520000", "서귀포시"),
//    DOBONG("6500000","6510000", "제주시"),
//    DOBONG("6500000","6500000", "제주특별자치도")/
//

    private String uprCd;
    //시군구코드
    private String orgCd;
    //시군구명
    private String orgdownNm;

    SigunguEnum(String uprCd, String orgCd, String orgdownNm) {
        this.uprCd = uprCd;
        this.orgCd = orgCd;
        this.orgdownNm = orgdownNm;
    }

    public String getUprCd() {
        return uprCd;
    }

    public void setUprCd(String uprCd) {
        this.uprCd = uprCd;
    }

    public String getOrgCd() {
        return orgCd;
    }

    public void setOrgCd(String orgCd) {
        this.orgCd = orgCd;
    }

    public String getOrgdownNm() {
        return orgdownNm;
    }

    public void setOrgdownNm(String orgdownNm) {
        this.orgdownNm = orgdownNm;
    }

    public SigunguEnum getvalueOf(String uprCd) {
        for (SigunguEnum sigunguEnum : SigunguEnum.values()) {
            if (sigunguEnum.getUprCd() == uprCd)
                return sigunguEnum;
        }
        return null;
    }
}
