package com.tech.miaa.util;

import java.util.ArrayList;

public class PrdCode {

	public enum Prd {
		//대분류코드
		PRI000("컴퓨터"), PRJ000("휴대폰"), PRH000("지갑"), PRG000("전자기기"), PRD000("산업용품"), PRO000("귀금속"), PRZ000("기타물품"),
		PRC000("서류"), PRE000("스포츠용품"), PRF000("자동차"), PRL000("현금"), PRK000("의류"), PRQ000("쇼핑백"), PRR000("악기"),
		PRP000("카드"), PRM000("유가증권"), PRN000("증명서"), PRA000("가방"), PRB000("도서용품"), PRX000("유류품"), 
		
		
		//여기서 코드 줄바꿈 하지마세요. 띄어쓰기 되면 오류납니다.
		//여기서 코드 줄바꿈 하지마세요. 띄어쓰기 되면 오류납니다.
		//여기서 코드 줄바꿈 하지마세요. 띄어쓰기 되면 오류납니다.
		//여기서 코드 줄바꿈 하지마세요. 띄어쓰기 되면 오류납니다.
		//여기서 코드 줄바꿈 하지마세요. 띄어쓰기 되면 오류납니다.
		//여기서 코드 줄바꿈 하지마세요. 띄어쓰기 되면 오류납니다.
		//중분류 코드
		PRI100("삼성노트북"),PRI200("LG노트북"), PRI300("삼보노트북"), PRI400("기타"), PRI500("HP노트북"), PRI600("애플노트북"), PRJ100("삼성휴대폰"),
		PRJ200("LG휴대폰"), PRJ300("스카이휴대폰"), PRJ400("아이폰"), PRJ500("기타통신기기"), PRJ600("모토로라휴대폰"), PRJ900("기타휴대폰"),
		PRH100("여성용지갑"), PRH200("남성용지갑"), PRH300("기타지갑"), PRG100("PMP"), PRG200("MP3"), PRG300("PDA"), PRG400("카메라"),
		PRG500("전자수첩"), PRG600("기타용품"), PRG700("태블릿"), PRG800("스마트워치"), PRG900("무선이어폰"), PRD100("기타물품"), PRO100("반지"),
		PRO200("목걸이"), PRO300("귀걸이"), PRO400("시계"), PRO500("기타"), PRZ100("기타"), PRZ200("매장문화재"), PRZ600("선글라스"),
		PRZ700("안경"), PRC100("서류"), PRC200("기타물품"), PRE100("스포츠용품"), PRE200("수영복"), PRE300("수영물품"), PRF100("자동차열쇠"),
		PRF200("네비게이션"), PRF300("자동차번호판"), PRF400("기타용품"), PRF500("임시번호판"), PRL100("현금"), PRL200("수표"), PRL300("기타"),
		PRL400("외화"), PRK100("여성의류"), PRK200("남성의류"), PRK300("아기의류"), PRK400("기타의류"), PRK500("모자"), PRK600("신발"),
		PRQ100("쇼핑백"), PRR100("건반악기"), PRR200("관악기"), PRR300("타악기"), PRR400("현악기"), PRR900("기타악기"), PRP100("신용(체크)카드"),
		PRP200("일반카드"), PRP300("기타카드"), PRM100("어음"), PRM200("상품권"), PRM300("채권"), PRM400("기타"), PRN100("신분증"),
		PRN200("면허증"), PRN300("여권"), PRN400("기타"), PRN500("판결문"), PRA100("여성용가방"), PRA200("남성용가방"), PRA300("기타가방"),
		PRB100("학습서적"), PRB200("소설"), PRB300("컴퓨터서적"), PRB400("만화책"), PRB500("기타서적"), PRX100("유류품"),
		
		//색
		CL1001("흰색"), CL1002("검정"), CL1003("빨강"), CL1004("주황"), CL1005("노랑"), CL1006("초록"), CL1007("파랑"), CL1008("갈색"), CL1009("보라"),
        CL1010("핑크"), CL1011("기타"),
        
        //지역
		LCA000("서울특별시"), LCH000("강원도"), LCI000("경기도"), LCJ000("경상남도"), LCK000("경상북도"), LCQ000("광주광역시"), LCR000("대구광역시"),
		LCS000("대전광역시"), LCT000("부산광역시"), LCU000("울산광역시"), LCV000("인천광역시"), LCL000("전라남도"), LCM000("전라북도"), LCN000("충청남도"),
		LCO000("충청북도"), LCP000("제주특별자치도"), LCW000("세종특별자치시"), LCF000("해외"), LCE000("기타"),
		
		P417000("개"), P422400("고양이"), P429900("기타"),
		
		C000054("골든 리트리버"),C000056("그레이 하운드"),C000055("그레이트 덴"),C000118("그레이,트 피레니즈"),C000115("기타"),C000037("꼬똥 드 뚤레아"),
		C000081("네오폴리탄 마스티프"),C000204("노르포크 테리어"),C000083("노리치 테리어"),C00216("노퍽 테리어"),C000082("뉴펀들랜드"),C000038("닥스훈트"),
		C000039("달마시안"),C000040("댄디 딘몬트 테리어"),C000043("도고 까니리오"),C000042("도고 아르젠티노"),C000153("도고 아르젠티노"),C000041("도베르만"),C000120("도사"),C000219("도사 믹스견"),C000155("동경견"),C000069("라브라도 리트리버"),C000071("라사 압소"),C000142("라이카"),
		C000093("래빗 닥스훈드"),C000167("랫 테리어"),C000070("레이크랜드 테리어"),C000166("로디지안 리즈백"),C000094("로트와일러"),C000121("로트와일러"),
		C000223("로트와일러 믹스견"),C000152("마리노이즈"),C000073("마스티프"),C000146("말라뮤트"),C000072("말티즈"),C000159("맨체스터테리어"),
		C000076("미니어쳐 닥스훈트"),C000075("미니어쳐 불 테리어"),C000079("미니어쳐 슈나우저"),C000078("미니어쳐 푸들"),C000077("미니어쳐 핀셔"),
		C000074("미디엄 푸들"),C000080("미텔 스피츠"),C000114("믹스견"),C000133("바센지"),C000012("바셋 하운드"),C000017("버니즈 마운틴 독"),
		C000015("베들링턴 테리어"),C000164("벨기에 그로넨달"),C000157("벨기에 쉽독"),C000148("벨기에 테뷰런"),C000016("벨지안 셰퍼드 독"),C000020("보더 콜리"),C000021("보르조이"),C000022("보스턴 테리어"),C000024("복서"),C000208("볼로네즈"),C000023("부비에 데 플랑드르"),C000026("불 테리어"),C000027("불독"),C000169("브뤼셀그리펀"),C000025("브리타니 스파니엘"),C000019("블랙 테리어"),C000013("비글"),C000018("비숑 프리제"),
		C000014("비어디드 콜리"),C000162("비즐라"),C000085("빠삐용"),C000096("사모예드"),C000095("살루키"),C000001("삽살개"),C000034("샤페이"),
		C000104("세인트 버나드"),C000031("센트럴 아시안 오브차카"),C000099("셔틀랜드 쉽독"),C000122("셰퍼드"),C000123("슈나우져"),C000097("스코티쉬 테리어"),
		C000132("스코티시 디어하운드"),C000154("스태퍼드셔 불 테리어"),C000222("스태퍼드셔 불 테리어 믹스견"),C000105("스탠다드 푸들"),C000124("스피츠"),
		C000100("시바"),C000103("시베리안 허스키"),C000151("시베리안라이카"),C000139("시잉프랑세즈"),C000101("시츄"),C000102("시코쿠"),C000098("실리햄 테리어"),C000136("실키테리어"),C000202("아나톨리안 셰퍼드"),C000160("아메리칸 불독"),C000203("아메리칸 스태퍼드셔 테리어"),
		C000221("아메리칸 스태퍼드셔 테리어 믹스견"),C000008("아메리칸 아키다"),C000131("아메리칸 에스키모"),C000009("아메리칸 코카 스파니엘"),
		C000119("아메리칸 핏불 테리어"),C000220("아메리칸 핏불 테리어 믹스견"),C000150("아메리칸불리"),C000210("아이리쉬 레드 앤 화이트 세터"),
		C000057("아이리쉬 세터"),C000058("아이리쉬 울프 하운드"),C000059("아이리쉬소프트코튼휘튼테리어"),C000006("아키다"),C000004("아프간 하운드"),
		C000007("알라스칸 말라뮤트"),C000005("에어델 테리어"),C000143("오브차카"),C000011("오스트랄리안 셰퍼드 독"),C000010("오스트랄리안 캐틀 독"),
		C000217("오스트레일리안 켈피"),C000137("올드 잉글리쉬 불독"),C000084("올드 잉글리쉬 쉽독"),C000163("와이마라너"),C000112("와이어 폭스 테리어"),
		C000113("요크셔 테리어"),C000149("울프독"),C211("웨스트 시베리언 라이카"),C000110("웨스트하이랜드화이트"),C000205("웰시 코기 카디건"),C000108("웰시 코기 펨브로크"),C000109("웰시 테리어"),C000060("이탈리안 그레이 하운드"),C000046("잉글리쉬 세터"),C000047("잉글리쉬 스프링거 스파니엘"),C000044("잉글리쉬 코카 스파니엘"),C000045("잉글리쉬 포인터"),C000053("자이언트 슈나우져"),C000062("재패니즈 스피츠"),C000061("잭 러셀 테리어"),C000052("저먼 셰퍼드 독"),C000165("저먼 와이어헤어드 포인터"),C000051("저먼 포인터"),C215("저먼 헌팅 테리어"),C000156(""),C000129("제페니즈칭"),C000067("진도견"),C000035("차우차우"),C000033("차이니즈 크레스티드 독"),C000032("치와와"),C000028("카네 코르소"),C000158("카레리안 베어독"),
		C000144("카이훗"),C000030("캐벌리어 킹 찰스 스파니엘"),C000029("케니스펜더"),C000064("케리 블루 테리어"),C000207("케언 테리어"),C000002("코리아 트라이 하운드"),C000068("코리안 마스티프"),C000125("코카 스파니엘"),C000141("코카 푸"),C000145("코카시안오브차카"),C000036("콜리"),C000066("클라인스피츠"),C000065("키슈"),C000063("키스 훈드"),C000140("토이 맨체스터 테리어"),C000107("토이 푸들"),C000106("티베탄 마스티프"),C000209("파라오 하운드"),C000086("파슨 러셀 테리어"),C000088("팔렌"),C000090("퍼그"),C000087("페키니즈"),C000138("페터데일테리어"),C000089("포메라니안"),C000126("포인터"),C000127("폭스테리어"),C000128("푸들"),C000091("풀리"),C000003("풍산견"),C000161("프레사까나리오"),C000050("프렌치 불독"),C000168("프렌치 브리타니"),C000049("플랫 코티드 리트리버"),C000147("플롯하운드"),C000092("피레니안 마운틴 독"),C000048("필라 브라질레이로"),C000135("핏불테리어"),C000224("핏불테리어 믹스견"),C000206("허배너스"),C000130("화이트리트리버"),C000134("화이트테리어"),C000111("휘"),

		C000116("고양이"),C000201("기타"),C000170("노르웨이 숲"),C000218("니벨룽"),C000171("데본 렉스"),C000172("러시안 블루"),C00213("레그돌"),C000173("레그돌-라가머"),C000174("맹크스"),C000175("먼치킨"),C000176("메인쿤"),C000212("믹스묘"),C000177("발리네즈"),C000178("버만"),C000179("벵갈"),C000180("봄베이"),C000216("브리티쉬롱헤어"),C000181("브리티시 쇼트헤어"),C000182("사바나캣"),C000183("샤트룩스"),C000184("샴"),C000185("셀커크 렉스"),C000186("소말리"),C000187("스노우 슈"),C000188("스코티시폴드"),C000189("스핑크스"),C000190("시베리안 포레스트"),C000191("싱가퓨라"),C000192("아메리칸 쇼트헤어"),C000193("아비시니안"),C000194("재패니즈밥테일"),C000195("터키시 앙고라"),C000196("통키니즈"),C00214("페르시안"),C000197("페르시안 친칠"),C000198("하바나 브라운"),C000199("하일랜드 폴드"),C000200("한국 고양"),
		
		C000117("기타축종");
		
		private final String PrdCd;

		Prd(String PrdCd) {
			this.PrdCd = PrdCd;
		}

		public String getPrdName() {
			return PrdCd;
		}

	}

	public void UpperPrd() {
		System.out.println("대분류 목록");
		int cnt = 1;
		for (Prd c : Prd.values()) {
			if (c.name().substring(3).equals("000")) {
				System.out.println(cnt + " : " + c.getPrdName());
				cnt++;
			}
		}
	}

//	물품분류명입력시 코드값반환
	public Prd getPrdCode(String Prdname) {
		for (Prd c : Prd.values()) {
			if (c.getPrdName().equals(Prdname)) {
				return c;
			}
		}
		return null; // 일치하는 열거 상수를 찾지 못한 경우 null을 반환
	}

//	코드값 입력시 분류명 반환
	public String getPrdNameByCode(String code) {
		for (Prd c : Prd.values()) {
			if (c.name().equals(code)) {
				return c.getPrdName();
			}
		}
		return "해당하는 물품분류명이 없습니다";
	}

// 상위,하위분류
	public ArrayList<String> getLowerNameByCode(String numcode) {
		ArrayList<String> lowerPrd = new ArrayList<String>();
		for (Prd c : Prd.values()) {
			if (c.name().substring(0, 3).equals(numcode.substring(0, 3)) && !c.name().substring(3).equals("000")) {
				lowerPrd.add(c.getPrdName());
			}
		}
		return lowerPrd;
	}

}
